Emagician.org
* Base initialization and Circle Casting

#+begin_src emacs-lisp
(defconst emagician/version "0.2.1")
#+end_src

  Look, if you're here, either you're a mutant (horray!), or I have
  done something horribly wrong. (boo!).

  Frankly the defaults here should be good enough that no-one should
  need to change them.  And by good enough I mean, really basic things
  like bog-standard libraries required, package managers set up.
  Things like spaces, tabs, and all the important stuff are in their
  own file.

** Splash 

*** Show on startup:
   	- [ ] Sigil
   	- [ ] Diary
   	- [ ] Date/time
   	- [ ] Shortcut list
      - [ ] Open up Magit status buffers
      - [ ] Dired to a dir
      - [ ] Agenda
*** Warn user if there were problems on load 

*** Message info
	- After load, store messages sowmerhew
	- diff them with the existing messages and show diffs to user

** Breakage happens, lets try and make it easier to deal with.
   Snarfed this idea from https://github.com/overtone/emacs-live.
   Which goes to show: even if you use the word brogrammer you might
   still have good ideas.

#+begin_src emacs-lisp
  (setq initial-scratch-message
        (concat ";; -|-+-|- Invocation Failure.  Sorry." "\n"
                ";; You know what to do." "\n"
                ";; \n"
                ";; Emagician Starter kit Version: " emagician/version "\n"
                ";; \n"
                ";;;;;;;;;;;;;;;;;;;;;;;;;;" "\n"
                ";;                      ;;" "\n"      
                ";; It's dangerous to go ;;" "\n"
                ";; alone! take this:    ;;" "\n"
                ";;                      ;;" "\n"
                ";;    ♨   (°-°)   ♨    ;;" "\n"
                ";;                      ;;" "\n"
                ";;;;;;;;;;;;  ;;;;;;;;;;;;" "\n"
                "\n"
                "(shell-command \"emacs --debug-init\")\n"))                
#+end_src  

** Inhibit the splash screen, and use the scratch buffer as our screen.
#+begin_src emacs-lisp
  (setq inhibit-splash-screen t)
  
  (defun emagician/show-scratch ()
    "Show the scratch buffer"
    (interactive)
    (set-window-buffer nil "*scratch*"))
  
  (add-hook 'emacs-startup-hook 'emagician/show-scratch t)
#+end_src
** Meta Development

   Emagician sets up a few of its own functions for helpful debugging
   and development of itself.  Most of these are to be found in
   [[file:Emagician-Meta.org]], but a little bit of bootstrapping is nice.

#+begin_src emacs-lisp
(defun emagician-reload ()
  "Reload the init file"
  (interactive)
  (org-babel-load-file (expand-file-name "Emagician.org" emagician-dir)))
#+end_src

*** TODO custom agenda for Emagician

** Paths, Startup files, etc.

   Load paths, customizations, etc.
#+begin_src emacs-lisp
(add-to-list 'load-path emagician-dir)
(setq custom-file (concat emagician-dir "custom.el"))
(add-to-list 'load-path (concat emagician-dir "src"))
(add-to-list 'load-path (concat emagician-dir "dist"))
#+end_src

*** More breakage help
	Since we now know where the emagician dir is, and it is okay, lets add that to the initial scratch message.

#+begin_src emacs-lisp
  (setq initial-scratch-message 
        (concat initial-scratch-message
                "\n"
                "(find-file-other-window emagician-dir)" "\n"
                "(find-file-other-window (concat emagician-dir \"*.org\") t)" "\n"))
#+end_src

** Ubiquitious Packages

   These need to be not-autoloaded, cause they are EVERYWHERE MAN.

#+begin_src emacs-lisp
    (require 'cl)
    (require 'saveplace)
    (require 'ffap)
    (require 'uniquify)
    (require 'ansi-color)
    (require 'recentf)
#+end_src

** ELPA 
   MELPA, ELPA and Marmalade!  Oh my!

#+begin_src emacs-lisp
    (setq package-user-dir (concat emagician-dir "elpa"))
    
    (setq package-archives
          '(("gnu"         . "http://elpa.gnu.org/packages/")
            ("marmalade"   . "http://marmalade-repo.org/packages/")
            ("MELPA"       . "http://melpa.milkbox.net/packages/")
            ("org"         . "http://orgmode.org/elpa/")))
    
    (package-initialize)
    
    (unless package-archive-contents
      (package-refresh-contents))
#+end_src


   For sake of archival purposes, here are 2 other potential ELPA
   archives.

#+begin_example
            ("original"    . "http://tromey.com/elpa/")
#+end_example

*** TODO Loading stuff from ELPA automagickally
    http://kieranhealy.org/esk/starter-kit-elpa.html
** Themes
#+begin_src emacs_lisp
(add-to-list 'custom-theme-load-path (concat emagician-dir "themes"))
#+end_src 
** Base initalization function set

   There are a number of baseline things we need to do, like custom loaders, macros for setting up hooks, etc. etc.

*** Starter Kit Load

   Originally from Eschulte.  This function takes a <foo>.org file,
   and load it.  It can also be given the argument of a sub tree, which 
   is defined as either a proper ord id, or a tag. 

   If the subtree is a tag, then all subtrees with that tag are collected and loaded.
**** NEXT check to see if file exists before trying to load 
#+name: starter-kit-load
#+begin_src emacs-lisp
  (defvar emagician--starter-kit-depth 0)
  (defun emagician-starter-kit-load (file &optional header-or-tag)
    "Load configuration from other .org files.
  If the optional argument is the id of a subtree then only
  configuration from within that subtree will be loaded.  If it is
  not an id then it will be interpreted as a tag, and only subtrees
  marked with the given tag will be loaded.
  
  For example, to load all of lisp.org simply
  add (emagician-starter-kit-load \"lisp\") to your configuration.
  
  To load only the 'window-system' config from
  emagician-starter-kit-misc-recommended.org add
   (emagican-starter-kit-load \"misc-recommended\" \"window-system\")
  to your configuration."
  
    (let ((file (expand-file-name (if (string-match ".+\.org" file)
                                      file
                                    (format "%s.org" file))
                                  emagician-dir))
          (load-result nil))
      (if (file-exists-p file)
          (progn
            (setq initial-scratch-message 
                  (concat initial-scratch-message "\n"
                          ";; Loading " file))
            (setq load-result
                  (org-babel-load-file
                   (if header-or-tag
                       (let* ((base (file-name-nondirectory file))
                              (dir  (file-name-directory file))
                              (partial-file (expand-file-name
                                             (concat "." (file-name-sans-extension base)
                                                     ".part." header-or-tag ".org")
                                             dir)))
                         (unless (file-exists-p partial-file)
                           (with-temp-file partial-file
                             (insert
                              (with-temp-buffer
                                (insert-file-contents file)
                                (save-excursion
                                  (condition-case nil ;; collect as a header
                                      (progn
                                        (org-link-search (concat"#"header-or-tag))
                                        (org-narrow-to-subtree)
                                        (buffer-string))
                                    (error ;; collect all entries with as tags
                                     (let (body)
                                       (org-map-entries
                                        (lambda ()
                                          (save-restriction
                                            (org-narrow-to-subtree)
                                            (setq body (concat body "\n" (buffer-string)))))
                                        header-or-tag)
                                       body))))))))
                         partial-file)
                     file))))
        (progn 
          (setq initial-scratch-message
                (concat initial-scratch-message "\n"
                        ";; Skipped Loading " file " It doesn't exist!"))
          (setq load-result nil)))
      (setq initial-scratch-message 
            (concat initial-scratch-message
                    "...done!" "\n"))
      load-result))
  
#+end_src
**** TODO fix documentation 
*** Load User/System Specific Files
