Emagician.el

(defconst emagician/version "0.2.1")

(setq initial-scratch-message
      (concat ";; -|-+-|- Invocation Failure.  Sorry." "\n"
              ";; You know what to do." "\n"
              ";; \n"
              ";; Emagician Starter kit Version: " emagician/version "\n"
              ";; \n"
              ";;;;;;;;;;;;;;;;;;;;;;;;;;" "\n"
              ";;                      ;;" "\n"      
              ";; It's dangerous to go ;;" "\n"
              ";; alone! take this:    ;;" "\n"
              ";;                      ;;" "\n"
              ";;    ♨   (°-°)   ♨    ;;" "\n"
              ";;                      ;;" "\n"
              ";;;;;;;;;;;;  ;;;;;;;;;;;;" "\n"
              "\n"
              "(shell-command \"emacs --debug-init\")\n"))

(setq inhibit-splash-screen t)

(defun emagician/show-scratch ()
  "Show the scratch buffer"
  (interactive)
  (set-window-buffer nil "*scratch*"))

(add-hook 'emacs-startup-hook 'emagician/show-scratch t)

(defun emagician-reload ()
  "Reload the init file"
  (interactive)
  (org-babel-load-file (expand-file-name "Emagician.org" emagician-dir)))

(add-to-list 'load-path emagician-dir)
(setq custom-file (concat emagician-dir "custom.el"))
(add-to-list 'load-path (concat emagician-dir "src"))
(add-to-list 'load-path (concat emagician-dir "dist"))

(setq initial-scratch-message 
      (concat initial-scratch-message
              "\n"
              "(find-file-other-window emagician-dir)" "\n"
              "(find-file-other-window (concat emagician-dir \"*.org\") t)" "\n"))

(require 'cl)
(require 'saveplace)
(require 'ffap)
(require 'uniquify)
(require 'ansi-color)
(require 'recentf)

(setq package-user-dir (concat emagician-dir "elpa"))

(setq package-archives
      '(("gnu"         . "http://elpa.gnu.org/packages/")
        ("marmalade"   . "http://marmalade-repo.org/packages/")
        ("MELPA"       . "http://melpa.milkbox.net/packages/")
        ("org"         . "http://orgmode.org/elpa/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

(defvar emagician--starter-kit-depth 0)
(defun emagician-starter-kit-load (file &optional header-or-tag)
  "Load configuration from other .org files.
If the optional argument is the id of a subtree then only
configuration from within that subtree will be loaded.  If it is
not an id then it will be interpreted as a tag, and only subtrees
marked with the given tag will be loaded.

For example, to load all of lisp.org simply
add (emagician-starter-kit-load \"lisp\") to your configuration.

To load only the 'window-system' config from
emagician-starter-kit-misc-recommended.org add
 (emagican-starter-kit-load \"misc-recommended\" \"window-system\")
to your configuration."

  (let ((file (expand-file-name (if (string-match ".+\.org" file)
                                    file
                                  (format "%s.org" file))
                                emagician-dir))
        (load-result nil))
    (if (file-exists-p file)
        (progn
          (setq initial-scratch-message 
                (concat initial-scratch-message "\n"
                        ";; Loading " file))
          (setq load-result
                (org-babel-load-file
                 (if header-or-tag
                     (let* ((base (file-name-nondirectory file))
                            (dir  (file-name-directory file))
                            (partial-file (expand-file-name
                                           (concat "." (file-name-sans-extension base)
                                                   ".part." header-or-tag ".org")
                                           dir)))
                       (unless (file-exists-p partial-file)
                         (with-temp-file partial-file
                           (insert
                            (with-temp-buffer
                              (insert-file-contents file)
                              (save-excursion
                                (condition-case nil ;; collect as a header
                                    (progn
                                      (org-link-search (concat"#"header-or-tag))
                                      (org-narrow-to-subtree)
                                      (buffer-string))
                                  (error ;; collect all entries with as tags
                                   (let (body)
                                     (org-map-entries
                                      (lambda ()
                                        (save-restriction
                                          (org-narrow-to-subtree)
                                          (setq body (concat body "\n" (buffer-string)))))
                                      header-or-tag)
                                     body))))))))
                       partial-file)
                   file))))
      (progn 
        (setq initial-scratch-message
              (concat initial-scratch-message "\n"
                      ";; Skipped Loading " file " It doesn't exist!"))
        (setq load-result nil)))
    (setq initial-scratch-message 
          (concat initial-scratch-message
                  "...done!" "\n"))
    load-result))

(when nil
