Emagician.org
***** System/User specific customizations
You can keep system- or user-specific customizations here in either
raw emacs-lisp files or as embedded elisp in org-mode files (as done
in this document).

You can keep elisp source in the =src= directory.  Packages loaded
from here will override those installed by ELPA.  This is useful if
you want to track the development versions of a project, or if a
project is not in elpa.

After we've loaded all the Starter Kit defaults, lets load the User's stuff.
#+name: starter-kit-load-files
#+begin_src emacs-lisp
(when nil
  (flet ((sk-load (base)
           (let* ((path          (expand-file-name base emagician-dir))
                  (literate      (concat path ".org"))
                  (encrypted-org (concat path ".org.gpg"))
                  (plain         (concat path ".el"))
                  (encrypted-el  (concat path ".el.gpg")))
             (cond
              ((file-exists-p encrypted-org) (org-babel-load-file encrypted-org))
              ((file-exists-p encrypted-el)  (load encrypted-el))
              ((file-exists-p literate)      (org-babel-load-file literate))
              ((file-exists-p plain)         (load plain)))))
         (remove-extension (name)
           (string-match "\\(.*?\\)\.\\(org\\(\\.el\\)?\\|el\\)\\(\\.gpg\\)?$" name)
           (match-string 1 name)))
    (let ((elisp-dir (expand-file-name "src" emagician-dir))
          (user-dir (expand-file-name user-login-name emagician-dir)))
      ;; add the src directory to the load path
      (add-to-list 'load-path elisp-dir)
      ;; load specific files
      (when (file-exists-p elisp-dir)
        (let ((default-directory elisp-dir))
          (normal-top-level-add-subdirs-to-load-path)))
      ;; load system-specific config
      (sk-load system-name)
      ;; load user-specific config
      (sk-load user-login-name)
      ;; load any files in the user's directory
      (when (file-exists-p user-dir)
        (add-to-list 'load-path user-dir)
        (mapc #'sk-load
              (remove-duplicates
               (mapcar #'remove-extension
                       (directory-files user-dir t ".*\.\\(org\\|el\\)\\(\\.gpg\\)?$"))
               :test #'string=)))))
)
#+end_src

*** Settings from M-x customize
#+name: m-x-customize-customizations
#+begin_src emacs-lisp
  (load custom-file 'noerror)
#+end_src

* Starter Kit Core
As with the other starter kit, there are some fundamentals that need
to be delt with. 
** Write hook macro
   - name, hook to hook into, arguments, body
   -> hook function defined, and added

#+begin_src emacs-lisp
  (defmacro emagician/defhook (name hook &rest b)
    (let* ((docp (stringp (car b)))
           (body (if docp (cdr b) b)))
      `(progn 
         (defun ,name () 
           ,(concat (if docp (car b) "Not Documented\n") "\nEmagically defined with emagician/defhook.")
           ,@body)
         (add-hook (quote ,hook) (quote ,name)))))
  
#+end_src

(macroexpand '(emagician/defhook name hook "docstring" body))
(progn (defun name nil "docstring
Emagically defined with emagician/defhook." body) (add-hook (quote hook) (quote name)))


*** NEXT write tests
*** NEXT fix indentation 
*** NEXT fix slightly shoddy implementation to not suck. 
** TODO write a mode-specific-hook macro.
   i.e. (if (eq major-mode ...) ...)
*** NEXT write macro
*** TODO write tests
** Basic hook functions and macros
*** defhook 
*** emagician/minor-in-major-mode 
   This macro will help build your turn-on-minor-mode functions that are so helpful, and automagickally add them to a major mode.  It won't try to re-define the turn-on mode if it is already defined.

#+begin_src emacs-lisp
      (defmacro emagician-minor-in-major-mode (major-mode minor-mode)
        (let ((turn-on-symbol (intern (concat "turn-on-" (symbol-name minor-mode)))))
          (list
           'progn 
           (when (not (fboundp turn-on-symbol))
             `(defun ,turn-on-symbol ()
                "Automagickally generated by emagicians starter kit."
                (,minor-mode +1)))
           `(add-hook ,major-mode ,minor-mode))))
    
    (ert-deftest emagician-test-minor-in-major-mode ()
      "emagician-minor-in-major macro test"
      (should (equal (macroexpand '(emagician-minor-in-major-mode elisp-mode paredit-mode))
                     '(progn (defun turn-on-paredit-mode "Automagickally generated by emagicians starter kit." (paredit-mode +1))
                             (add-hook elisp-mode paredit-mode)))))
    
#+end_src

*** Key Definition Hooks

   Bit of a crappy definition here, but it's something.  This can be probably better handled.
**** TODO broken. need to fix. 
#+begin_src emacs-lisp
    (defmacro emagician/define-mode-key (mode-name key command)
      (let ((define-key-fname (make-symbol (concat (symbol-name mode-name)
                                                   "-key-<"
                                                   (replace-regexp-in-string "\s"
                                                                             "_"
                                                                             (key-description key))
                                                   ">-"
                                                   (symbol-name command)
                                                   "-hook"))))
        `(progn
           (defun ,define-key-fname ()
             ,(concat "Automatically generated hook function. Binds " key " to " (symbol-name command))
             (define-key ,(make-symbol (concat (symbol-name mode-name) "-map")) ,key ,command))
           (add-hook (quote ,(make-symbol (concat (symbol-name mode-name) "-hook"))) 
                     (quote ,define-key-fname)))))
  
  (when nil
    (pp (macroexpand '(emagician/define-mode-key org-mode (kbd "C-SPC") foo)))
(progn
  (defun org-mode-key-<<kbd>_C-SPC>-foo-hook nil "Automatically generated hook function by Emagician/Starter/kit"
	(define-key org-mode-map
	  (kbd "C-SPC")
	  foo))
  (add-hook 'org-mode-hook 'org-mode-key-<<kbd>_C-SPC>-foo-hook))

"(progn
  (defun org-mode-key-<<kbd>_C-SPC>-foo-hook nil \"Automatically generated hook function\"
	(define-key org-mode-map
	  (kbd \"C-SPC\")
	  foo))
  (add-hook 'org-mode-hook 'org-mode-key-<<kbd>_C-SPC>-foo-hook))
" 
  )
#+end_src
**** TODO Figure out if this needs to be optimized
**** TODO make a new definition to build a custom command
** Required Package handling

   Instead of having to front-load packages like paredit, slime, etc.   why can't they be auto-installed as needed?  That's what this does.

   This is so that required packages can be properly loaclized.
#+begin_src emacs-lisp
  (defun emagician-expect-package (package)
    "If the named PACKAGE isn't currently installed, install it"
    (unless (package-installed-p package)
      (package-install package)))  
#+end_src

*** TODO make it check an internet connection before installing

** TODO figure out if an executeable exists, and do stuff based on that
*** NEXT browse info to see if that functionality exists
*** TODO Write case for pdflatex: [[file:darwin.org::*You%20will%20want%20to%20get%20the%20latest%20version%20of%20mactex%20to%20make%20this%20go:][file:darwin.org::*You will want to get the latest version of mactex to make this go:]]
* More sensible emacs defaults
** Format and Coding system
#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
#+end_src

* Development Core
  
  Ok, if you're an emagician, you're a developer of some kind or
  another.  You may "just" be working in eslip, or you might be a
  ployglot proficient in Low-level C, Scheme, Ruby and Rails, and
  Java. Either way, you're a dev.
**  Programming mode hooks 

*** Newline and indent
#+begin_src emacs-lisp
(emagician/define-mode-key prog "RET" newline-and-indent)
#+end_src
*** Line numbers
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'linum-mode)
#+end_src 

** Global Modes that are cool
*** Show Paren Mode
#+begin_src emacs-lisp
(show-paren-mode)
#+end_src
*** TODO add to "programming-modes" list.  
*** TODO line numbers
*** TODO Fix definition in the yank under editing
*** TODO add standard hooks into it 
	- [ ] auto-pair mode
	- [ ] linum mode
	- [ ] flash parens ()
*** CEDET
   I don't have enough mojo to work with cedet yet.  Working on it.  

#+name: load-cedet
#+begin_src emacs-lisp
  (setq semantic-default-submodes 
        (append semantic-default-submodes
                '(global-semantic-idle-summary-mode
                  global-semantic-idle-completions-mode
                  global-semantic-idle-scheduler-mode
                  global-semantic-decoration-mode
                  global-semantic-hilight-func-mode
                  global-semantic-stickyfuc-mode)))
  
  ;; Enable Semantic
  (semantic-mode 1)
  
#+end_src

*** WhichFunc
#+begin_src emacs-lisp
(which-function-mode t)
#+end_src
*** TODO add magic to it.  maybe look at programming modes
*** Flymake Setup
**** Pah! Mouse menus.  PAH I say.
#+begin-src emacs-lisp
(emagician-expect-package 'flymake-cursor)
#+end_src
**** Tone flymake down a little
#+begin_src emacs-lisp
(setq flymake-no-changes-timeout 2.5)
#+end_src

** Basic Coding Hook
*** TODO needs to be snarfed and barfed from the emacs starter kit
* Load Users Customizations
** TODO fix this temporary shit here
#+begin_src emacs-lisp
(emagician-starter-kit-load (concat emagician-dir "Emagician-Jonnay"))
#+end_src
 
** TODO there is a problem with trying to load an empty el file.  This needs to be fixed at the org level soruce.
*** NEXT get development version of org
*** TODO make branch
*** TODO make test case
*** TODO fix
*** TODO commit
** True Name Initialization
#+begin_src emacs-lisp 
(emagician-starter-kit-load emagician-truename)   
#+end_src
** System Type Initialization
*** TODO fix the replace regex here
**** NEXT abstract as function
**** TODO proper character conversion (otehr chars are not good too!)
