Emagician.org
**** TODO make initializer work as well. 
#+begin_src emacs-lisp 
(emagician-starter-kit-load (replace-regexp-in-string "/" 
                                                 "-" 
                                                 (symbol-name system-type)))
#+end_src  
** Machine Name Initialization
#+begin_src emacs-lisp 
(emagician-starter-kit-load system-name)
#+end_src
** Login name Initialization
#+begin_src emacs-lisp 
(emagician-starter-kit-load user-login-name)
#+end_src

* Set the scratch variable.

#+begin_src emacs-lisp
  
  (setq initial-scratch-message
        (concat ";;; -|-+-|- Sekrut Alien Technology -|-+-|-" "\n"
                ";;; Hail Eris.  All Hail Discordia." "\n"
                ";;;\n"
                ";;; Emacs Vesrion: " emacs-version "\n" 
                ";;; Emagician Starter kit Version: " emagician/version "\n"
                ";;; " "\n"
                (format ";;; Your startup took approximately %.2f seconds" 
                        (- (float-time after-init-time)
                           (float-time before-init-time))) "\n"                                                      
                ";;; -|-+-|- Sekrut Alien Technology -|-+-|-" "\n"
                ";;;\n"
                 (mapconcat (lambda (line) 
                              (concat ";;; " line "\n")) 
                            (split-string (cookie (concat emagician-dir 
                                                          "assets/collected-chaos.lines")
                                                  ""
                                                  "")
                                          "\n")
  
                            "")
                ))
#+end_src 

* References, Bibliography, Shout Outs, and Props.
  - ESchultes Emacs Starter Kit :: https://github.com/eschulte/emacs-starter-kit
  - Sacha Chu :: http://dl.dropbox.com/u/3968124/sacha-emacs.html
  - Emacs Starter Kit :: https://github.com/technomancy/emacs-starter-kit
  - Cabbage  :: https://github.com/senny/cabbage
  - Emacs Live :: https://github.com/overtone/emacs-live (even if they are brogrammers)
  - novoid :: https://github.com/novoid/dot-emacs
  - ocodo :: https://github.com/ocodo/emacs.d
* The End
#+begin_src 
(provide 'emagician)
#+end_src
