Emagician.el
                                                 (symbol-name system-type)))

(emagician-starter-kit-load system-name)

(emagician-starter-kit-load user-login-name)

(setq initial-scratch-message
      (concat ";;; -|-+-|- Sekrut Alien Technology -|-+-|-" "\n"
              ";;; Hail Eris.  All Hail Discordia." "\n"
              ";;;\n"
              ";;; Emacs Vesrion: " emacs-version "\n" 
              ";;; Emagician Starter kit Version: " emagician/version "\n"
              ";;; " "\n"
              (format ";;; Your startup took approximately %.2f seconds" 
                      (- (float-time after-init-time)
                         (float-time before-init-time))) "\n"                                                      
              ";;; -|-+-|- Sekrut Alien Technology -|-+-|-" "\n"
              ";;;\n"
               (mapconcat (lambda (line) 
                            (concat ";;; " line "\n")) 
                          (split-string (cookie (concat emagician-dir 
                                                        "assets/collected-chaos.lines")
                                                ""
                                                "")
                                        "\n")

                          "")
              ))
